#-----------------------------------------------------------------------
#   FITTED INVERSE
#-----------------------------------------------------------------------
"""
    μfit(τ,tpfl=Float64)

This is the inverse function for the inverse of the Δτatt(μ) function.
"""
function μfit(τ,tpfl=Float64)
    Δτattf=x->Δτatt(x,tpfl(0.5313221978739817))
    (τ1,τ2,τ3,τ4) = Δτattf.(tpfl.([0.07,0.22,0.35,0.5313221978739817]))
    p1 = tpfl.([3.263971450572428, -42.88219119836167, 1.2584411462429956])
    p2 = tpfl.([4.486663262024078, -3.6478908016981264, 0.15685587976398715])
    p3 = tpfl.([6.4206443998659894, 2.50412233921934, 0.013345133310312682])

    f=(x,p)->( x*p[3] / (one(typeof(x)) - p[2]*x) )^(1/p[1])

    if τ < τ1
        return (tpfl(81)*τ/tpfl(32))^(1/3)
    elseif τ < τ2
        return f(τ,p1)
    elseif τ <= τ3
        return f(τ,p2)
    elseif τ <= τ4
        return f(τ,p3)
    elseif τ >= τ4
        return f(τ4,p3)
    else
        return zero(tpfl)
    end
end #-------------------------------------------------------------------

#-----------------------------------------------------------------------
#   FITTED TIME FUNCTION
#-----------------------------------------------------------------------
"""
    τfit(μ,tpfl=Float64)

This is the fitted Δτatt(μ) function.
"""
function τfit(μ,tpfl=Float64)
    (μ1,μ2,μ3,μ4) = tpfl.([0.07,0.22,0.35,0.5313221978739817])
    p1 = tpfl.([3.263971450572428, -42.88219119836167, 1.2584411462429956])
    p2 = tpfl.([4.486663262024078, -3.6478908016981264, 0.15685587976398715])
    p3 = tpfl.([6.4206443998659894, 2.50412233921934, 0.013345133310312682])

    f=(x,p)->( x^p[1] )/( p[2]*(x^p[1]) + p[3] )

    if μ < μ1
        return tpfl(32)*μ^3/tpfl(81)
    elseif μ < μ2
        return f(μ,p1)
    elseif μ <= μ3
        return f(μ,p2)
    elseif μ <= μ4
        return f(μ,p3)
    elseif μ >= μ4
        return f(μ4,p3)
    else
        return zero(tpfl)
    end
end #-------------------------------------------------------------------

#-----------------------------------------------------------------------
#   COMPOSITE μ
#-----------------------------------------------------------------------
"""
    μcomp(τ,b0,z0=tpfl(0.5313221978739817),
            Δτattz0=tpfl(0.306420207087353767),tpfl=Float64)

This is a composite 'μ' function.
"""
function μcomp(τ,b0,z0=tpfl(0.5313221978739817),
                    Δτattz0=tpfl(0.30505917474345556),tpfl=Float64)
    ONE     = one(tpfl)
    if τ <= Δτattz0
        return μfit(τ,tpfl)
    elseif τ > Δτattz0
        return z0+log(ONE+b0*(τ-Δτattz0))/b0
    else
        return zero(tpfl)
    end
end #-------------------------------------------------------------------